<template>
  <div class="model">
    <Header style="background: #FFFFFF; height: 30px; text-align: center; max-width: 100%;">
      <i class="close-left" @click="goTo">
        <svg t="1567585969191" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
             p-id="1713" width="16" height="16">
          <path
            d="M209.92 988.16c-15.36 0-30.72-15.36-30.72-30.72s15.36-30.72 30.72-30.72h471.04c153.6 0 281.6-128 281.6-281.6s-128-281.6-281.6-281.6H102.4l220.16 220.16c5.12 5.12 10.24 10.24 10.24 20.48 0 5.12-5.12 15.36-10.24 20.48-5.12 5.12-10.24 10.24-20.48 10.24-5.12 0-15.36-5.12-20.48-10.24L10.24 353.28c-5.12-5.12-10.24-10.24-10.24-20.48 0-5.12 5.12-15.36 10.24-20.48L281.6 40.96c5.12-5.12 10.24-10.24 20.48-10.24 5.12 0 15.36 5.12 20.48 10.24 0 10.24 5.12 15.36 5.12 25.6 0 5.12-5.12 15.36-10.24 20.48L97.28 307.2h583.68a343.04 343.04 0 0 1 0 686.08H209.92z"
            fill="#d81e06" p-id="1714"></path>
        </svg>
      </i>
    </Header>
    <Tabs :animated="true">
      <TabPane label="待付款">
        <div class="model-row">
          <div class="model-row-div">
            <img src="/static/image/mainmo.jpg" class="model-row-div-img" alt="">
            <p>
              <span class="model-row-div-title">霸王洗发露</span>
              <span class="model-row-div-much">
              <svg t="1567478430914" style="margin-top: -3px;" class="icon" viewBox="0 0 1024 1024" version="1.1"
                   xmlns="http://www.w3.org/2000/svg"
                   p-id="2760"
                   width="16" height="16"><path
                d="M228.677632 136.922112 250.308608 123.259904 504.19712 490.998784 520.136704 490.998784 774.024192 123.259904 795.656192 137.491456 551.44448 490.998784 823.703552 490.998784 823.703552 517.184512 533.228544 517.184512 526.190592 528.572416 526.190592 657.219584 823.703552 657.219584 823.703552 682.267648 526.190592 682.267648 526.190592 901.434368 499.073024 901.434368 499.073024 683.410432 200.948736 683.410432 200.948736 656.084992 499.073024 656.084992 499.073024 529.711104 490.677248 516.614144 200.948736 516.614144 200.948736 490.99776 472.887296 490.99776Z"
                p-id="2761" fill="red"></path></svg>
                100
              </span>
            </p>
            <br>
            <div class="model-row-div-text">
              洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到
              <p class="model-row-div-time">2019-10-15</p>
            </div>
          </div>
        </div>
        <div class="model-row">
          <div class="model-row-div">
            <img src="/static/image/mainmo.jpg" class="model-row-div-img" alt="">
            <p>
              <span class="model-row-div-title">霸王洗发露</span>
              <span class="model-row-div-much">
              <svg t="1567478430914" style="margin-top: -3px;" class="icon" viewBox="0 0 1024 1024" version="1.1"
                   xmlns="http://www.w3.org/2000/svg"
                   p-id="2760"
                   width="16" height="16"><path
                d="M228.677632 136.922112 250.308608 123.259904 504.19712 490.998784 520.136704 490.998784 774.024192 123.259904 795.656192 137.491456 551.44448 490.998784 823.703552 490.998784 823.703552 517.184512 533.228544 517.184512 526.190592 528.572416 526.190592 657.219584 823.703552 657.219584 823.703552 682.267648 526.190592 682.267648 526.190592 901.434368 499.073024 901.434368 499.073024 683.410432 200.948736 683.410432 200.948736 656.084992 499.073024 656.084992 499.073024 529.711104 490.677248 516.614144 200.948736 516.614144 200.948736 490.99776 472.887296 490.99776Z"
                p-id="2761" fill="red"></path></svg>
                100
              </span>
            </p>
            <br>
            <div class="model-row-div-text">
              洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到
              <p class="model-row-div-time">2019-10-15</p>
            </div>
          </div>
        </div>
        <div class="model-row">
          <div class="model-row-div">
            <img src="/static/image/mainmo.jpg" class="model-row-div-img" alt="">
            <p>
              <span class="model-row-div-title">霸王洗发露</span>
              <span class="model-row-div-much">
              <svg t="1567478430914" style="margin-top: -3px;" class="icon" viewBox="0 0 1024 1024" version="1.1"
                   xmlns="http://www.w3.org/2000/svg"
                   p-id="2760"
                   width="16" height="16"><path
                d="M228.677632 136.922112 250.308608 123.259904 504.19712 490.998784 520.136704 490.998784 774.024192 123.259904 795.656192 137.491456 551.44448 490.998784 823.703552 490.998784 823.703552 517.184512 533.228544 517.184512 526.190592 528.572416 526.190592 657.219584 823.703552 657.219584 823.703552 682.267648 526.190592 682.267648 526.190592 901.434368 499.073024 901.434368 499.073024 683.410432 200.948736 683.410432 200.948736 656.084992 499.073024 656.084992 499.073024 529.711104 490.677248 516.614144 200.948736 516.614144 200.948736 490.99776 472.887296 490.99776Z"
                p-id="2761" fill="red"></path></svg>
                100
              </span>
            </p>
            <br>
            <div class="model-row-div-text">
              洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到
              <p class="model-row-div-time">2019-10-15</p>
            </div>
          </div>
        </div>
        <div class="model-row">
          <div class="model-row-div">
            <img src="/static/image/mainmo.jpg" class="model-row-div-img" alt="">
            <p>
              <span class="model-row-div-title">霸王洗发露</span>
              <span class="model-row-div-much">
              <svg t="1567478430914" style="margin-top: -3px;" class="icon" viewBox="0 0 1024 1024" version="1.1"
                   xmlns="http://www.w3.org/2000/svg"
                   p-id="2760"
                   width="16" height="16"><path
                d="M228.677632 136.922112 250.308608 123.259904 504.19712 490.998784 520.136704 490.998784 774.024192 123.259904 795.656192 137.491456 551.44448 490.998784 823.703552 490.998784 823.703552 517.184512 533.228544 517.184512 526.190592 528.572416 526.190592 657.219584 823.703552 657.219584 823.703552 682.267648 526.190592 682.267648 526.190592 901.434368 499.073024 901.434368 499.073024 683.410432 200.948736 683.410432 200.948736 656.084992 499.073024 656.084992 499.073024 529.711104 490.677248 516.614144 200.948736 516.614144 200.948736 490.99776 472.887296 490.99776Z"
                p-id="2761" fill="red"></path></svg>
                100
              </span>
            </p>
            <br>
            <div class="model-row-div-text">
              洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到
              <p class="model-row-div-time">2019-10-15</p>
            </div>
          </div>
        </div>
      </TabPane>
      <TabPane label="待发货">
        <div class="model-row">
          <div class="model-row-div">
            <img src="/static/image/mainmo.jpg" class="model-row-div-img" alt="">
            <p>
              <span class="model-row-div-title">霸王洗发露</span>
              <span class="model-row-div-much">
              <svg t="1567478430914" style="margin-top: -3px;" class="icon" viewBox="0 0 1024 1024" version="1.1"
                   xmlns="http://www.w3.org/2000/svg"
                   p-id="2760"
                   width="16" height="16"><path
                d="M228.677632 136.922112 250.308608 123.259904 504.19712 490.998784 520.136704 490.998784 774.024192 123.259904 795.656192 137.491456 551.44448 490.998784 823.703552 490.998784 823.703552 517.184512 533.228544 517.184512 526.190592 528.572416 526.190592 657.219584 823.703552 657.219584 823.703552 682.267648 526.190592 682.267648 526.190592 901.434368 499.073024 901.434368 499.073024 683.410432 200.948736 683.410432 200.948736 656.084992 499.073024 656.084992 499.073024 529.711104 490.677248 516.614144 200.948736 516.614144 200.948736 490.99776 472.887296 490.99776Z"
                p-id="2761" fill="red"></path></svg>
                100
              </span>
            </p>
            <br>
            <div class="model-row-div-text">
              洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到
              <p class="model-row-div-time">2019-10-15</p>
            </div>
          </div>
        </div>
        <div class="model-row">
          <div class="model-row-div">
            <img src="/static/image/mainmo.jpg" class="model-row-div-img" alt="">
            <p>
              <span class="model-row-div-title">霸王洗发露</span>
              <span class="model-row-div-much">
              <svg t="1567478430914" style="margin-top: -3px;" class="icon" viewBox="0 0 1024 1024" version="1.1"
                   xmlns="http://www.w3.org/2000/svg"
                   p-id="2760"
                   width="16" height="16"><path
                d="M228.677632 136.922112 250.308608 123.259904 504.19712 490.998784 520.136704 490.998784 774.024192 123.259904 795.656192 137.491456 551.44448 490.998784 823.703552 490.998784 823.703552 517.184512 533.228544 517.184512 526.190592 528.572416 526.190592 657.219584 823.703552 657.219584 823.703552 682.267648 526.190592 682.267648 526.190592 901.434368 499.073024 901.434368 499.073024 683.410432 200.948736 683.410432 200.948736 656.084992 499.073024 656.084992 499.073024 529.711104 490.677248 516.614144 200.948736 516.614144 200.948736 490.99776 472.887296 490.99776Z"
                p-id="2761" fill="red"></path></svg>
                100
              </span>
            </p>
            <br>
            <div class="model-row-div-text">
              洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到
              <p class="model-row-div-time">2019-10-15</p>
            </div>
          </div>
        </div>
        <div class="model-row">
          <div class="model-row-div">
            <img src="/static/image/mainmo.jpg" class="model-row-div-img" alt="">
            <p>
              <span class="model-row-div-title">霸王洗发露</span>
              <span class="model-row-div-much">
              <svg t="1567478430914" style="margin-top: -3px;" class="icon" viewBox="0 0 1024 1024" version="1.1"
                   xmlns="http://www.w3.org/2000/svg"
                   p-id="2760"
                   width="16" height="16"><path
                d="M228.677632 136.922112 250.308608 123.259904 504.19712 490.998784 520.136704 490.998784 774.024192 123.259904 795.656192 137.491456 551.44448 490.998784 823.703552 490.998784 823.703552 517.184512 533.228544 517.184512 526.190592 528.572416 526.190592 657.219584 823.703552 657.219584 823.703552 682.267648 526.190592 682.267648 526.190592 901.434368 499.073024 901.434368 499.073024 683.410432 200.948736 683.410432 200.948736 656.084992 499.073024 656.084992 499.073024 529.711104 490.677248 516.614144 200.948736 516.614144 200.948736 490.99776 472.887296 490.99776Z"
                p-id="2761" fill="red"></path></svg>
                100
              </span>
            </p>
            <br>
            <div class="model-row-div-text">
              洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到
              <p class="model-row-div-time">2019-10-15</p>
            </div>
          </div>
        </div>
        <div class="model-row">
          <div class="model-row-div">
            <img src="/static/image/mainmo.jpg" class="model-row-div-img" alt="">
            <p>
              <span class="model-row-div-title">霸王洗发露</span>
              <span class="model-row-div-much">
              <svg t="1567478430914" style="margin-top: -3px;" class="icon" viewBox="0 0 1024 1024" version="1.1"
                   xmlns="http://www.w3.org/2000/svg"
                   p-id="2760"
                   width="16" height="16"><path
                d="M228.677632 136.922112 250.308608 123.259904 504.19712 490.998784 520.136704 490.998784 774.024192 123.259904 795.656192 137.491456 551.44448 490.998784 823.703552 490.998784 823.703552 517.184512 533.228544 517.184512 526.190592 528.572416 526.190592 657.219584 823.703552 657.219584 823.703552 682.267648 526.190592 682.267648 526.190592 901.434368 499.073024 901.434368 499.073024 683.410432 200.948736 683.410432 200.948736 656.084992 499.073024 656.084992 499.073024 529.711104 490.677248 516.614144 200.948736 516.614144 200.948736 490.99776 472.887296 490.99776Z"
                p-id="2761" fill="red"></path></svg>
                100
              </span>
            </p>
            <br>
            <div class="model-row-div-text">
              洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到
              <p class="model-row-div-time">2019-10-15</p>
            </div>
          </div>
        </div>
      </TabPane>
      <TabPane label="待收货">
        <div class="model-row">
          <div class="model-row-div">
            <img src="/static/image/mainmo.jpg" class="model-row-div-img" alt="">
            <p>
              <span class="model-row-div-title">霸王洗发露</span>
              <span class="model-row-div-much">
              <svg t="1567478430914" style="margin-top: -3px;" class="icon" viewBox="0 0 1024 1024" version="1.1"
                   xmlns="http://www.w3.org/2000/svg"
                   p-id="2760"
                   width="16" height="16"><path
                d="M228.677632 136.922112 250.308608 123.259904 504.19712 490.998784 520.136704 490.998784 774.024192 123.259904 795.656192 137.491456 551.44448 490.998784 823.703552 490.998784 823.703552 517.184512 533.228544 517.184512 526.190592 528.572416 526.190592 657.219584 823.703552 657.219584 823.703552 682.267648 526.190592 682.267648 526.190592 901.434368 499.073024 901.434368 499.073024 683.410432 200.948736 683.410432 200.948736 656.084992 499.073024 656.084992 499.073024 529.711104 490.677248 516.614144 200.948736 516.614144 200.948736 490.99776 472.887296 490.99776Z"
                p-id="2761" fill="red"></path></svg>
                100
              </span>
            </p>
            <br>
            <div class="model-row-div-text">
              洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到
              <p class="model-row-div-time">2019-10-15</p>
            </div>
          </div>
        </div>
        <div class="model-row">
          <div class="model-row-div">
            <img src="/static/image/mainmo.jpg" class="model-row-div-img" alt="">
            <p>
              <span class="model-row-div-title">霸王洗发露</span>
              <span class="model-row-div-much">
              <svg t="1567478430914" style="margin-top: -3px;" class="icon" viewBox="0 0 1024 1024" version="1.1"
                   xmlns="http://www.w3.org/2000/svg"
                   p-id="2760"
                   width="16" height="16"><path
                d="M228.677632 136.922112 250.308608 123.259904 504.19712 490.998784 520.136704 490.998784 774.024192 123.259904 795.656192 137.491456 551.44448 490.998784 823.703552 490.998784 823.703552 517.184512 533.228544 517.184512 526.190592 528.572416 526.190592 657.219584 823.703552 657.219584 823.703552 682.267648 526.190592 682.267648 526.190592 901.434368 499.073024 901.434368 499.073024 683.410432 200.948736 683.410432 200.948736 656.084992 499.073024 656.084992 499.073024 529.711104 490.677248 516.614144 200.948736 516.614144 200.948736 490.99776 472.887296 490.99776Z"
                p-id="2761" fill="red"></path></svg>
                100
              </span>
            </p>
            <br>
            <div class="model-row-div-text">
              洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到
              <p class="model-row-div-time">2019-10-15</p>
            </div>
          </div>
        </div>
        <div class="model-row">
          <div class="model-row-div">
            <img src="/static/image/mainmo.jpg" class="model-row-div-img" alt="">
            <p>
              <span class="model-row-div-title">霸王洗发露</span>
              <span class="model-row-div-much">
              <svg t="1567478430914" style="margin-top: -3px;" class="icon" viewBox="0 0 1024 1024" version="1.1"
                   xmlns="http://www.w3.org/2000/svg"
                   p-id="2760"
                   width="16" height="16"><path
                d="M228.677632 136.922112 250.308608 123.259904 504.19712 490.998784 520.136704 490.998784 774.024192 123.259904 795.656192 137.491456 551.44448 490.998784 823.703552 490.998784 823.703552 517.184512 533.228544 517.184512 526.190592 528.572416 526.190592 657.219584 823.703552 657.219584 823.703552 682.267648 526.190592 682.267648 526.190592 901.434368 499.073024 901.434368 499.073024 683.410432 200.948736 683.410432 200.948736 656.084992 499.073024 656.084992 499.073024 529.711104 490.677248 516.614144 200.948736 516.614144 200.948736 490.99776 472.887296 490.99776Z"
                p-id="2761" fill="red"></path></svg>
                100
              </span>
            </p>
            <br>
            <div class="model-row-div-text">
              洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到
              <p class="model-row-div-time">2019-10-15</p>
            </div>
          </div>
        </div>
        <div class="model-row">
          <div class="model-row-div">
            <img src="/static/image/mainmo.jpg" class="model-row-div-img" alt="">
            <p>
              <span class="model-row-div-title">霸王洗发露</span>
              <span class="model-row-div-much">
              <svg t="1567478430914" style="margin-top: -3px;" class="icon" viewBox="0 0 1024 1024" version="1.1"
                   xmlns="http://www.w3.org/2000/svg"
                   p-id="2760"
                   width="16" height="16"><path
                d="M228.677632 136.922112 250.308608 123.259904 504.19712 490.998784 520.136704 490.998784 774.024192 123.259904 795.656192 137.491456 551.44448 490.998784 823.703552 490.998784 823.703552 517.184512 533.228544 517.184512 526.190592 528.572416 526.190592 657.219584 823.703552 657.219584 823.703552 682.267648 526.190592 682.267648 526.190592 901.434368 499.073024 901.434368 499.073024 683.410432 200.948736 683.410432 200.948736 656.084992 499.073024 656.084992 499.073024 529.711104 490.677248 516.614144 200.948736 516.614144 200.948736 490.99776 472.887296 490.99776Z"
                p-id="2761" fill="red"></path></svg>
                100
              </span>
            </p>
            <br>
            <div class="model-row-div-text">
              洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到洒汗水打湿到
              <p class="model-row-div-time">2019-10-15</p>
            </div>
          </div>
        </div>
      </TabPane>
    </Tabs>
  </div>
</template>

<script>
    export default {
        name: "order",
        methods : {
            goTo: function () {
                window.history.back();
            }
        }
    }
</script>

<style scoped>
  .model {
    height: 100%;
    width: 100%;
    /*padding-left: 10%;*/
    /*padding-right: 10%;*/
    position: relative;
    top: 0;
    padding-top: 20px;
  }

  .model-row {
    height: 100px;
    padding: 15px;
  }

  .model-row-div-img {
    width: 80px;
    height: 80px;
    display: inline-block;
    float: left;
    margin-right: 10px;
  }

  .model-row-div-title {
    font-size: 16px;
    float: left;
    color: #444444;
  }

  .model-row-div-much {
    color: red;
    float: right;
  }

  .model-row-div-text {
    display: block;
    float: bottom;
    font-size: 12px;
    text-align: left;
    margin-top: 8px;
    overflow: hidden;
    white-space: nowrap;
    text-overflow: ellipsis;
  }

  .model-row-div-time {
    font-size: 10px;
    color: #bcbcbc;
    margin-top: 17px;
    float: right;
  }

  .close-left {
    width: 10px;
    height: 10px;
    position: absolute;
    left: 5%;
  }

  .model-row-div {
  }
</style>
